Revit 2024 API
SolidGeometry Enumeration
 An enumerated type listing possible ways of exporting solids in 3D views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum SolidGeometry
Visual Basic
Public Enumeration SolidGeometry
Visual C++
public enum class SolidGeometry
Members
Member name | Description
Polymesh |  All visible solids are exported as polymesh.
ACIS |  All visible Revit Building geometry is exported as ACIS 3D solids (except for any elements that are already a polymesh.)
See Also
Autodesk.Revit.DB Namespace